In [3]:
import pandas as pd

In [10]:
df = pd.read_csv("TG_STAID000001.txt", skiprows=20, parse_dates=["    DATE"])

In [14]:
df

       STAID   SOUID       DATE     TG   Q_TG
0          1   35381 1860-01-01     21      0
1          1   35381 1860-01-02     46      0
2          1   35381 1860-01-03     31      0
3          1   35381 1860-01-04     37      0
4          1   35381 1860-01-05     31      0
...      ...     ...        ...    ...    ...
59316      1   35381 2022-05-27  -9999      9
59317      1   35381 2022-05-28  -9999      9
59318      1   35381 2022-05-29  -9999      9
59319      1   35381 2022-05-30  -9999      9
59320      1   35381 2022-05-31  -9999      9

[59321 rows x 5 columns]

In [16]:
# Remove -9999 from df

In [17]:
df.loc[df['   TG'] != -9999]

       STAID   SOUID       DATE     TG   Q_TG
0          1   35381 1860-01-01     21      0
1          1   35381 1860-01-02     46      0
2          1   35381 1860-01-03     31      0
3          1   35381 1860-01-04     37      0
4          1   35381 1860-01-05     31      0
...      ...     ...        ...    ...    ...
53655      1   35381 2006-11-26     80      0
53656      1   35381 2006-11-27     70      0
53657      1   35381 2006-11-28     71      0
53658      1   35381 2006-11-29     63      0
53659      1   35381 2006-11-30     84      0

[53103 rows x 5 columns]

In [23]:
df_ok = df.loc[df['   TG'] != -9999]

In [24]:
df_ok

       STAID   SOUID       DATE     TG   Q_TG
0          1   35381 1860-01-01     21      0
1          1   35381 1860-01-02     46      0
2          1   35381 1860-01-03     31      0
3          1   35381 1860-01-04     37      0
4          1   35381 1860-01-05     31      0
...      ...     ...        ...    ...    ...
53655      1   35381 2006-11-26     80      0
53656      1   35381 2006-11-27     70      0
53657      1   35381 2006-11-28     71      0
53658      1   35381 2006-11-29     63      0
53659      1   35381 2006-11-30     84      0

[53103 rows x 5 columns]

In [26]:
df_ok['   TG'].mean() / 10

6.360787526128467